/* # ***** BEGIN LICENSE BLOCK ***** */
/* # Version: MPL 1.1/GPL 2.0/LGPL 2.1 */
/* # */
/* # The contents of this file are subject to the Mozilla Public License Version */
/* # 1.1 (the \"License\"); you may not use this file except in compliance with */
/* # the License. You may obtain a copy of the License at */
/* # http://www.mozilla.org/MPL/ */
/* # */
/* # Software distributed under the License is distributed on an \"AS IS\" basis, */
/* # WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License */
/* # for the specific language governing rights and limitations under the */
/* # License. */
/* # */
/* # The Original Code is mozilla.org code. */
/* # */
/* # The Initial Developer of the Original Code is */
/* # Netscape Communications Corporation. */
/* # Portions created by the Initial Developer are Copyright (C) 2001 */
/* # the Initial Developer. All Rights Reserved. */
/* # */
/* # Contributor(s): */
/* #   Mitch <mstoltz@netscape.com> (original author) */
/* #   Ehsan Akhgari <ehsan.akhgari@gmail.com> */
/* # */
/* # Alternatively, the contents of this file may be used under the terms of */
/* # either of the GNU General Public License Version 2 or later (the \"GPL\"), */
/* # or the GNU Lesser General Public License Version 2.1 or later (the \"LGPL\"), */
/* # in which case the provisions of the GPL or the LGPL are applicable instead */
/* # of those above. If you wish to allow use of your version of this file only */
/* # under the terms of either the GPL or the LGPL, and not to allow others to */
/* # use your version of this file under the terms of the MPL, indicate your */
/* # decision by deleting the provisions above and replace them with the notice */
/* # and other provisions required by the GPL or the LGPL. If you do not delete */
/* # the provisions above, a recipient may use your version of this file under */
/* # the terms of any one of the MPL, the GPL or the LGPL. */
/* # */
/* # ***** END LICENSE BLOCK ***** */

"KillScriptTitle" = "Warning: Unresponsive script";
"KillScriptMessage" = "A script on this page may be busy, or it may have stopped responding. You can stop the script now, or you can continue to see if the script will complete.";
"KillScriptWithDebugMessage" = "A script on this page may be busy, or it may have stopped responding. You can stop the script now, open the script in the debugger, or let the script continue.";
"KillScriptLocation" = "Script: %S";
"StopScriptButton" = "Stop script";
"DebugScriptButton" = "Debug script";
"WaitForScriptButton" = "Continue";
"DontAskAgain" = "&Don’t ask me again";
"JSURLLoadBlockedWarning" = "Attempt to load a javascript: URL from one host\nin a window displaying content from another host\nwas blocked by the security manager.";
"WindowCloseBlockedWarning" = "Scripts may not close windows that were not opened by script.";
"OnBeforeUnloadPreMessage" = "Are you sure you want to navigate away from this page?";
"OnBeforeUnloadPostMessage" = "Press OK to continue, or Cancel to stay on the current page.";
"DocumentAllUsed" = "Non-standard document.all property was used. Use W3C standard document.getElementById() instead.";
"GlobalScopeElementReference" = "Element referenced by ID/NAME in the global scope. Use W3C standard document.getElementById() instead.";
"UseOfCaptureEventsWarning" = "Use of captureEvents() is deprecated. To upgrade your code, use the DOM 2 addEventListener() method. For more help http://developer.mozilla.org/en/docs/DOM:element.addEventListener";
"UseOfReleaseEventsWarning" = "Use of releaseEvents() is deprecated. To upgrade your code, use the DOM 2 removeEventListener() method. For more help http://developer.mozilla.org/en/docs/DOM:element.removeEventListener";
"UseOfRouteEventWarning" = "Use of routeEvent() is deprecated. To upgrade your code, use the DOM 2 dispatchEvent() method. For more help http://developer.mozilla.org/en/docs/DOM:element.dispatchEvent";
"UseOfPreventBubbleWarning" = "Event=%S, use of preventBubble() is deprecated. Use W3C standard stopPropagation() instead.";
"UseOfPreventCaptureWarning" = "Event=%S, use of preventCapture() is deprecated. Use W3C standard stopPropagation() instead.";
"UnexpectedCanvasVariantStyle" = "canvas: an attempt to set strokeStyle or fillStyle to a value that is neither a string, a CanvasGradient, or a CanvasPattern was ignored.";
"EmptyGetElementByIdParam" = "Empty string passed to getElementById().";
"LowMemoryTitle" = "Warning: Low memory";
"LowMemoryMessage" = "A script on this page has been stopped due to a low memory condition.";
"WrongEventPropertyAccessWarning" = "The ‘%S’ property of a %S event should not be used. The value is meaningless.";
